In [3]:
### Series

# similar to np array and built on top of it
# Series has access labels (index by label)

import pandas as pd

labels = ['a','b','c']
my_data = [10,20,30]
d = {'a':10,'b':20,'c':30}

# create a series
pd.Series(data = my_data) # gives us an index 012 etc for the data in the list

0    10
1    20
2    30
dtype: int64

In [4]:
pd.Series(data=my_data,index=labels) # set the index labels to the list above instead of 0,1,2 the default
# 'a' is the index and 10 is the actual data for that index

# if labels and data are in order, you can leave out named params
pd.Series(my_data,labels)

a    10
b    20
c    30
dtype: int64

In [5]:
# pass in dictionary, will take keys and set as index, and set value of key to the data val
pd.Series(d)

a    10
b    20
c    30
dtype: int64

In [6]:
ser1 = pd.Series([1,2,3,4],['USA','Germany','USSR','Japan'])
ser2 = pd.Series([1,2,5,4],['USA','Germany','Italy','Japan']) 

# access data in series - type in index label
ser1['USA']

1

In [7]:
ser3 = pd.Series(data=labels) # the labels of a,b,c are the data and index are default ints 0,1,2
ser3 # access a with ser3[0]

0    a
1    b
2    c
dtype: object

In [8]:
# adding series - will match by index and add the vals (ints) for that idx, if there is no match will use NaN
ser1 + ser2 # note that ints are converted into floats (numpy always uses floats)

Germany    4.0
Italy      NaN
Japan      8.0
USA        2.0
USSR       NaN
dtype: float64

In [9]:
#### DATAFRAMES
import numpy as np
from numpy.random import randn

np.random.seed(101)

# (data, row labels matching num rows, col labels matching num cols in data)
# cols are panda Series that share an index
df = pd.DataFrame(randn(5,4),['a','b','c','d','e'],['w','x','y','z']) 
df

          w         x         y         z
a  2.706850  0.628133  0.907969  0.503826
b  0.651118 -0.319318 -0.848077  0.605965
c -2.018168  0.740122  0.528813 -0.589001
d  0.188695 -0.758872 -0.933237  0.955057
e  0.190794  1.978757  2.605967  0.683509

In [10]:
df['w'] # the w col is a series - single cols are returned as a series, multiple cols as a dataframe

a    2.706850
b    0.651118
c   -2.018168
d    0.188695
e    0.190794
Name: w, dtype: float64

In [11]:
# get multiple cols, pass in a list of cols - returned as a dataframe instead of series
df[['w','z']]

          w         z
a  2.706850  0.503826
b  0.651118  0.605965
c -2.018168 -0.589001
d  0.188695  0.955057
e  0.190794  0.683509

In [12]:
# Create a new col
df['new'] = df['w'] + df['y'] 
df

          w         x         y         z       new
a  2.706850  0.628133  0.907969  0.503826  3.614819
b  0.651118 -0.319318 -0.848077  0.605965 -0.196959
c -2.018168  0.740122  0.528813 -0.589001 -1.489355
d  0.188695 -0.758872 -0.933237  0.955057 -0.744542
e  0.190794  1.978757  2.605967  0.683509  2.796762

In [13]:
# Remove col
df.drop('new', axis=1) # axis is 0 (row/index) by default. to drop cols need to set axis to 1

# NOTE: not in place by default, you get a new dataframe and original is unaffected!
df.drop('new',axis=1,inplace=True) # update the original dataframe and mutate it

In [14]:
# drop rows 
df.drop('e',axis=0)
df

          w         x         y         z
a  2.706850  0.628133  0.907969  0.503826
b  0.651118 -0.319318 -0.848077  0.605965
c -2.018168  0.740122  0.528813 -0.589001
d  0.188695 -0.758872 -0.933237  0.955057
e  0.190794  1.978757  2.605967  0.683509

In [15]:
# Selecting Rows (2 ways)

# use loc['row']
df.loc['a'] # returns a series, the cols are the index label for the data

# use iloc[] to get a index position (the number position even if the label is string)
df.iloc[2] # returns row c

w   -2.018168
x    0.740122
y    0.528813
z   -0.589001
Name: c, dtype: float64

In [16]:
# Selecting values in the data frame

# use loc[] with the row and col labels
df.loc['b','y'] # returns value at the cell

-0.8480769834036315

In [17]:
# Selecting range of row/col vals
# pass in a list with [rows],[cols]
df.loc[['a','b'],['w','y']]

          w         y
a  2.706850  0.907969
b  0.651118 -0.848077

In [18]:
# Conditional Selection

df[df>0] # gets all vals gerater than zero

# normally you don't use whole data frame, you use cols/rows specifically
print(df['w']>0) # series with booleans that tell whether the row of col w satisfies condition

print(df)
# use the series to get values in df where w col val is greater than zero
df[df['w']>0] # removes row c which had a negative val in w col, this also works to filter out NaN

a     True
b     True
c    False
d     True
e     True
Name: w, dtype: bool
          w         x         y         z
a  2.706850  0.628133  0.907969  0.503826
b  0.651118 -0.319318 -0.848077  0.605965
c -2.018168  0.740122  0.528813 -0.589001
d  0.188695 -0.758872 -0.933237  0.955057
e  0.190794  1.978757  2.605967  0.683509

          w         x         y         z
a  2.706850  0.628133  0.907969  0.503826
b  0.651118 -0.319318 -0.848077  0.605965
d  0.188695 -0.758872 -0.933237  0.955057
e  0.190794  1.978757  2.605967  0.683509

In [19]:
df[df['z']<0] # only row c

# can operate on filtered df:
df[df['w']>0][['x','y']]

          x         y
a  0.628133  0.907969
b -0.319318 -0.848077
d -0.758872 -0.933237
e  1.978757  2.605967

In [20]:
# Multiple Conditions

# use single ampersand & to combine conditions
df[(df['w']>0) & (df['y']>1)] # wrap conditions in parens

# use pipe | for an or condition
df[(df['w']>0) | (df['y']>1)] # wrap conditions in parens

          w         x         y         z
a  2.706850  0.628133  0.907969  0.503826
b  0.651118 -0.319318 -0.848077  0.605965
d  0.188695 -0.758872 -0.933237  0.955057
e  0.190794  1.978757  2.605967  0.683509

In [21]:
# Resetting an Index (the label)

df.reset_index() # row indexes go from letters back to default numericals, a new index col has the old labels

# to have it alter df, you need to pass in inplace=True

  index         w         x         y         z
0     a  2.706850  0.628133  0.907969  0.503826
1     b  0.651118 -0.319318 -0.848077  0.605965
2     c -2.018168  0.740122  0.528813 -0.589001
3     d  0.188695 -0.758872 -0.933237  0.955057
4     e  0.190794  1.978757  2.605967  0.683509

In [22]:
# set a new index
states = ['WY','CO','OH','MO','UT'] # matches row nums or axis 0 in data
df['States'] = states
print(df)

df.set_index('States') # makes the States the index labels for rows now
 # remember to add inplace=True if you want to alter the original dataframe (you lose the original index labels)

          w         x         y         z States
a  2.706850  0.628133  0.907969  0.503826     WY
b  0.651118 -0.319318 -0.848077  0.605965     CO
c -2.018168  0.740122  0.528813 -0.589001     OH
d  0.188695 -0.758872 -0.933237  0.955057     MO
e  0.190794  1.978757  2.605967  0.683509     UT

               w         x         y         z
States
WY      2.706850  0.628133  0.907969  0.503826
CO      0.651118 -0.319318 -0.848077  0.605965
OH     -2.018168  0.740122  0.528813 -0.589001
MO      0.188695 -0.758872 -0.933237  0.955057
UT      0.190794  1.978757  2.605967  0.683509

In [23]:
df.index.names # list of names for indexes

# name an index
df.index.names = ['My index'] 
df

                 w         x         y         z States
My index
a         2.706850  0.628133  0.907969  0.503826     WY
b         0.651118 -0.319318 -0.848077  0.605965     CO
c        -2.018168  0.740122  0.528813 -0.589001     OH
d         0.188695 -0.758872 -0.933237  0.955057     MO
e         0.190794  1.978757  2.605967  0.683509     UT

In [24]:
# MISSING VALUES

d = {'a':[1,2,np.nan],'b': [4,np.nan,np.nan],'c': [1,2,3]}
df = pd.DataFrame(d)
df

     a    b  c
0  1.0  4.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [25]:
# drop all emtpy values/rows
dropped = df.dropna() # drops any row with one or more missing values (if you don't pass anything in)
print(dropped)

# by default op occurs along axis 0 the rows, need to pass in axis to operate on cols
droppedcol = df.dropna(axis=1) # drops any cols with null value
droppedcol

     a    b  c
0  1.0  4.0  1

   c
0  1
1  2
2  3

In [26]:
# use a threshold to not drop unless you have a certain num of non-emtpy vals

d2 = {'a':[1,2,np.nan],'b': [4,np.nan,np.nan],'c': [1,2,3]}
df2 = pd.DataFrame(d2)
print(df2)

drop = df2.dropna(thresh=2) # keeps rows that have at least 2 nonempty values
drop # drops row 2 since there is only 1 nonempty val, but keeps row 1 since there are 2 nonempty vals

     a    b  c
0  1.0  4.0  1
1  2.0  NaN  2
2  NaN  NaN  3

     a    b  c
0  1.0  4.0  1
1  2.0  NaN  2

In [27]:
# Replace missing vals
filled = df.fillna(value='Filled')
print(filled)

# usually you'll use the mean of the col to fill in
withmean = df.fillna(value=df['a'].mean()) # fills empties with means of the col
withmean

        a       b  c
0     1.0     4.0  1
1     2.0  Filled  2
2  Filled  Filled  3

     a    b  c
0  1.0  4.0  1
1  2.0  1.5  2
2  1.5  1.5  3

In [28]:
### GROUPBY

# Allows you to get all rows by col and perform an aggregate function on them

data = {
    'Company': ['a','b','c','d','e','e'],
    'Person': ['Joe','Bob','Bill','Jill','Carl','Jack'],
    'Sales': [200,120,340,124,243,350]
}

df = pd.DataFrame(data)
df

  Company Person  Sales
0       a    Joe    200
1       b    Bob    120
2       c   Bill    340
3       d   Jill    124
4       e   Carl    243
5       e   Jack    350

In [29]:
byCompany = df.groupby('Company') # returns groupby obj

# now call methods on the grouped obj
mean = byCompany.mean(numeric_only=True) # will look for numeric sales col and get mean (need numeric_only arg)
# will ignore non numeric cols
print(mean)

sum = byCompany.sum(numeric_only=True)
print(sum)
std = byCompany.std(numeric_only=True)
print(std)

         Sales
Company
a        200.0
b        120.0
c        340.0
d        124.0
e        296.5
         Sales
Company
a          200
b          120
c          340
d          124
e          593
             Sales
Company
a              NaN
b              NaN
c              NaN
d              NaN
e        75.660426

In [30]:
salesForE = byCompany.sum().loc['e']['Sales']
salesForE
print(salesForE)

# Use count with groupby
counts = df.groupby('Company').count()
counts # was able to also get persons because it can count how many people per comp even though person is not numeric
print(counts)

# max and min
max = df.groupby('Company').max()
min = df.groupby('Company').min()
print(max)
print(min)

593
         Person  Sales
Company
a             1      1
b             1      1
c             1      1
d             1      1
e             2      2
        Person  Sales
Company
a          Joe    200
b          Bob    120
c         Bill    340
d         Jill    124
e         Jack    350
        Person  Sales
Company
a          Joe    200
b          Bob    120
c         Bill    340
d         Jill    124
e         Carl    243

In [31]:
# Using describe to get useful info on a group
report = df.groupby('Company').describe()
print('Report\n', report)
transposed = df.groupby('Company').describe().transpose()
print('Transposed\n',transposed)

single = df.groupby('Company').describe().transpose()['e']
print('single col\n',single)

Report
         Sales
        count   mean        std    min     25%    50%     75%    max
Company
a         1.0  200.0        NaN  200.0  200.00  200.0  200.00  200.0
b         1.0  120.0        NaN  120.0  120.00  120.0  120.00  120.0
c         1.0  340.0        NaN  340.0  340.00  340.0  340.00  340.0
d         1.0  124.0        NaN  124.0  124.00  124.0  124.00  124.0
e         2.0  296.5  75.660426  243.0  269.75  296.5  323.25  350.0
Transposed
 Company          a      b      c      d           e
Sales count    1.0    1.0    1.0    1.0    2.000000
      mean   200.0  120.0  340.0  124.0  296.500000
      std      NaN    NaN    NaN    NaN   75.660426
      min    200.0  120.0  340.0  124.0  243.000000
      25%    200.0  120.0  340.0  124.0  269.750000
      50%    200.0  120.0  340.0  124.0  296.500000
      75%    200.0  120.0  340.0  124.0  323.250000
      max    200.0  120.0  340.0  124.0  350.000000
single col
 Sales  count      2.000000
       mean     296.500000
       std       75.660426
       min      243.000000
       25%      269.750000
       50%      296.500000
       75%      323.250000
       max      350.000000
Name: e, dtype: float64

In [32]:
# Concatenate Dataframes

d1 = {'a':[1,2,3],'b':[4,5,6]}
d2 = {'a':[1,2,3],'b':[4,5,6]}
d3 = {'a':[1,2,3],'b':[4,5,6],}

df1 = pd.DataFrame(d1,index=[0,1,2])
df2 = pd.DataFrame(d1,index=[3,4,5])
df3 = pd.DataFrame(d1,index=[6,7,8])

pd.concat([df1,df2,df3]) # make sure dims between dfs match axis, here axis 0 by default (rows)

   a  b
0  1  4
1  2  5
2  3  6
3  1  4
4  2  5
5  3  6
6  1  4
7  2  5
8  3  6

In [33]:
# glue along col axis-1
pd.concat([df1,df2,df3],axis=1) # noticed missing values (row 0 does not have more than one set of ab)

     a    b    a    b    a    b
0  1.0  4.0  NaN  NaN  NaN  NaN
1  2.0  5.0  NaN  NaN  NaN  NaN
2  3.0  6.0  NaN  NaN  NaN  NaN
3  NaN  NaN  1.0  4.0  NaN  NaN
4  NaN  NaN  2.0  5.0  NaN  NaN
5  NaN  NaN  3.0  6.0  NaN  NaN
6  NaN  NaN  NaN  NaN  1.0  4.0
7  NaN  NaN  NaN  NaN  2.0  5.0
8  NaN  NaN  NaN  NaN  3.0  6.0

In [34]:
# Merging Dataframes

left = pd.DataFrame({'key': ['k0','k1','k2','k3'],
                     'A': ['a0','a1','a2','a3'],
                      'B': ['b0','b1','b2','b3'] })
right = pd.DataFrame({'key': ['k0','k1','k2','k3'],
                     'C': ['c0','c1','c2','c3'],
                      'D': ['d0','d1','d2','d3'] })

print(left)
print(right)

  key   A   B
0  k0  a0  b0
1  k1  a1  b1
2  k2  a2  b2
3  k3  a3  b3
  key   C   D
0  k0  c0  d0
1  k1  c1  d1
2  k2  c2  d2
3  k3  c3  d3

In [35]:
pd.merge(left,right,how='inner',on='key') # need to merge on a key column

# how can be 'outer' or 'right' as well. Usually use 'inner' by default

  key   A   B   C   D
0  k0  a0  b0  c0  d0
1  k1  a1  b1  c1  d1
2  k2  a2  b2  c2  d2
3  k3  a3  b3  c3  d3

In [36]:
# with two keys

left = pd.DataFrame({'key1': ['k0','k0','k1','k2'],
                     'key2': ['k0','k1','k0','k1'],
                     'A': ['a0','a1','a2','a3'],
                      'B': ['b0','b1','b2','b3'] })
right = pd.DataFrame({'key1': ['k0','k1','k1','k2'],
                      'key2': ['k0','k0','k0','k0'],
                     'C': ['c0','c1','c2','c3'],
                      'D': ['d0','d1','d2','d3'] })

print(left)
print(right)

pd.merge(left,right,on=['key1','key2'])

  key1 key2   A   B
0   k0   k0  a0  b0
1   k0   k1  a1  b1
2   k1   k0  a2  b2
3   k2   k1  a3  b3
  key1 key2   C   D
0   k0   k0  c0  d0
1   k1   k0  c1  d1
2   k1   k0  c2  d2
3   k2   k0  c3  d3

  key1 key2   A   B   C   D
0   k0   k0  a0  b0  c0  d0
1   k1   k0  a2  b2  c1  d1
2   k1   k0  a2  b2  c2  d2

In [37]:
# Join Dataframes


left = pd.DataFrame({
                     'A': ['a0','a1','a2'],
                      'B': ['b0','b1','b2'] },
                      index=['k0','k1','k2'])
right = pd.DataFrame({
                     'C': ['c0','c1','c2'],
                      'D': ['d0','d1','d2'] },
                      index=['k0','k2','k3'])

left.join(right) # inner by default, can use how='outer' or 'right' 'left'

     A   B    C    D
k0  a0  b0   c0   d0
k1  a1  b1  NaN  NaN
k2  a2  b2   c1   d1

In [61]:
# Common Operations

df.head() # show first few rows of dataframe

df = pd.DataFrame({
    'col1': [1,2,3,4],
    'col2': [444,555,666,444],
    'col3': ['abc','def','ghi','xyz']
})

# Unique values
uniq2 = df['col2'].unique() # uniq vals in col2
print(uniq2,'\n')

# num of unique entires
uniqcount = df['col2'].nunique()
print(uniqcount,'\n')

# get counts of how many times unique vals show up in the df
counts = df['col2'].value_counts()
print(counts)

# get name of col with the value count
print('names: ')
df['col2'].value_counts()

[444 555 666]

3

col2
444    2
555    1
666    1
Name: count, dtype: int64
names:

col2
444    2
555    1
666    1
Name: count, dtype: int64

In [39]:
# Apply your custom filter option - use apply()

def times2(x): 
    return x*2

customfn = df['col1'].apply(times2) # broadcasts function to each element in the col
print(customfn)

shorthnd = df['col1'].apply(lambda x: x*2) # use custom lambda to shorthand same fn above
print(shorthnd)

# use builtin fns to get info
lens = df['col3'].apply(len) # get length of strings in cols
print(lens)

0    2
1    4
2    6
3    8
Name: col1, dtype: int64
0    2
1    4
2    6
3    8
Name: col1, dtype: int64
0    3
1    3
2    3
3    3
Name: col3, dtype: int64

In [40]:
# drop cols
dr = df.drop('col1',axis=1) # remember to specify axis 1 for cols
dr

   col2 col3
0   444  abc
1   555  def
2   666  ghi
3   444  xyz

In [41]:
# get cols names

df.columns

# get index info 
df.index

RangeIndex(start=0, stop=4, step=1)

In [42]:
# sorting a col

df.sort_values('col2')

   col1  col2 col3
0     1   444  abc
3     4   444  xyz
1     2   555  def
2     3   666  ghi

In [43]:
# Find null values

df.isnull() # bools. we get all False because there are no empty vals in our df

    col1   col2   col3
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False

In [44]:
# reading files

# put files in same loc as notebook
import os
os.getcwd()

# import a csv file
pd.read_csv('example.csv')


# to write to a csv you need a dataframe  
df = pd.read_csv('example.csv')

# off a dataframe you can save a new output csv file if needed
df.to_csv('My_output', index=False) # need index-False to not save the index as an extra col - this will auto create a range index (0,1,2...)

# Excel files - note: pandas cannot import formulas or macros from excel files
  # in excel each sheet is considered a dataframe in pandas
pd.read_excel('Excel_Sample.xlsx',sheet_name='Sheet1')

# exporting a dataframe to excel 
df.to_excel('my_new_excel_file.xlsx',sheet_name='mynewsheet')

# HTML
data = pd.read_html('https://www.google.com') # results in list - pandas tries to find table elements in html page
data[0] # first item in list if it has data you're looking for.

FileNotFoundError: [Errno 2] No such file or directory: 'example.csv'

In [62]:
var=0
var2 = 0

var,var2 += 1

print(var,var2)

SyntaxError: illegal expression for augmented assignment (3710002858.py, line 4)

In [3]:
variable1 = 0
variable2 = 0

variable1, variable2 = [var + 1 for var in [variable1, variable2]]

print(variable1)
print(variable2)

1
1